In [24]:
import pandas as pd
import numpy as np
import re

In [25]:
df_new = pd.read_csv("../data/outputs/invoice_numbers_fixed_last.csv")

In [26]:
df_curated = pd.read_csv("../data/outputs/invoice_numbers_fixed.csv")

In [27]:
df_new

     Invoice Number  Total Charged
0         X15688941     2755430.00
1         813728138       18004.67
2         G42174195       10245.21
3          27307572       20873.79
4         E37309831       32837.29
...             ...            ...
8406      207061731       10623.99
8407      B91149000            NaN
8408      I80104458            NaN
8409      E26231313            NaN
8410      400092943         624.46

[8411 rows x 2 columns]

In [28]:
df_curated

     Invoice Number  Total Charged
0         X15688941     2755430.00
1         813728138       18004.67
2         G42174195       10245.21
3          27307572       20873.79
4         E37309831       32837.29
...             ...            ...
8406      207061731       10623.99
8407      B91149000            NaN
8408      I80104458            NaN
8409      E26231313            NaN
8410      400092943         624.46

[8411 rows x 2 columns]

In [29]:
df_new["Total Charged"].isna().sum()

1278

In [30]:
df_curated["Total Charged"].isna().sum()

1591

In [31]:
df_new["Total Charged"].describe()

count    7.133000e+03
mean     1.018076e+05
std      1.230620e+06
min     -5.165390e+07
25%      1.448414e+04
50%      2.337490e+04
75%      3.641124e+04
max      5.437558e+07
Name: Total Charged, dtype: float64

### Inputting error values

In [32]:
df_new.rename(columns={
                "Invoice Number": "invoice_number",
                "Total Charged": "total_charged",
            }, inplace=True,)